app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("body", "created_at", "post_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Here's a new tweet."], ["created_at", Mon, 27 May 2013 18:11:42 UTC +00:00], ["post_at", Mon, 27 May 2013 12:12:00 UTC +00:00], ["updated_at", Mon, 27 May 2013 18:11:42 UTC +00:00]]
---
  def create
    @tweet = Tweet.new(params[:tweet])
    if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_tweet
    @tweet = Tweet.find(params[:id])